In [1]:
import pandas as pd
import numpy as np
import pathfinder as pf

In [2]:
filename = "censo_1872-003_p1.csv"
path = pf.find_file(filename)
df = pd.read_csv(path)

# Quadro geral da população livre considerada em relação aos sexos, estados civis, raça, religião, nacionalidades e grau de instrução, com indicação dos números de casas e fogos

In [3]:
df.head(10)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 30,Unnamed: 31,Unnamed: 32,Unnamed: 33,Unnamed: 34,Unnamed: 35,Unnamed: 36,Unnamed: 37,Unnamed: 38,Unnamed: 39
0,NaN,NaN,NaN,NaN,Estados Civis,NaN,NaN,NaN,NaN,NaN,...,População escolar de 6 a 15 anos,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,Sexos,NaN,NaN,dos Homens,NaN,NaN,das Mulheres,NaN,NaN,...,Meninos,NaN,NaN,Meninas,NaN,NaN,Casas,NaN,NaN,NaN
2,Províncias e Município Neutro,Homens,Mulheres,Total,Solteiros,Casados,Viúvos,Solteiras,Casadas,Viúvas,...,Frequentam escolas,Não frequentam,Total,Frequentam escolas,Não frequentam,Total,Habitadas,Desabitadas,Total,Número de fogos
3,Amazonas,30983,2564,56631,24959,5105,919,19214,4714,1720,...,824,5056,5880,371,3269,3640,7661,229,7890,7811
4,Pará,128589,11919,247779,94848,28935,4806,86825,26280,6085,...,5768,25753,31521,3441,25020,28461,38978,2077,41055,39521
5,Maranhão,141942,14215,284101,103283,33644,5015,102302,32337,7520,...,8739,28142,36881,4844,29567,34411,47166,1405,48571,49282
6,Piauí,90322,8810,178427,63294,23323,3705,59547,23371,5187,...,1777,15960,17737,1024,16968,17992,29208,223,29431,30770
7,Ceará,350906,33886,689773,241692,99915,9299,224509,99849,14509,...,10021,83808,93829,5399,85087,90486,99901,2989,102890,100207
8,Rio Grande do Norte,112721,10823,220959,80803,26832,5086,75915,26735,5588,...,2643,18662,21305,2058,19857,21915,36710,706,37416,37320
9,Paraíba,179433,17526,354700,119403,53474,6556,112332,53274,9661,...,6630,44061,50691,3894,45830,49724,43767,522,44289,44438

In [4]:
print(df.columns)

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13',
       'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17',
       'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21',
       'Unnamed: 22', 'Unnamed: 23', 'Unnamed: 24', 'Unnamed: 25', 'Instrução',
       'Unnamed: 27', 'Unnamed: 28', 'Unnamed: 29', 'Unnamed: 30',
       'Unnamed: 31', 'Unnamed: 32', 'Unnamed: 33', 'Unnamed: 34',
       'Unnamed: 35', 'Unnamed: 36', 'Unnamed: 37', 'Unnamed: 38',
       'Unnamed: 39'],
      dtype='object')

# Sexos

In [5]:
sexos = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3']]
sexos.head()

                      Unnamed: 0 Unnamed: 1 Unnamed: 2 Unnamed: 3
0                            NaN        NaN        NaN        NaN
1                            NaN      Sexos        NaN        NaN
2  Províncias e Município Neutro     Homens   Mulheres      Total
3                       Amazonas      30983       2564      56631
4                           Pará     128589      11919     247779

In [6]:
sexos_header = sexos.iloc[1]
sexos.columns = sexos_header
sexos = sexos[2:]
sexos.head()

1                            NaN   Sexos       NaN     NaN
2  Províncias e Município Neutro  Homens  Mulheres   Total
3                       Amazonas   30983      2564   56631
4                           Pará  128589     11919  247779
5                       Maranhão  141942     14215  284101
6                          Piauí   90322      8810  178427

In [7]:
sexos_header = sexos.iloc[0]
sexos.columns = sexos_header
sexos = sexos[1:]
sexos.head()

2 Províncias e Município Neutro  Homens Mulheres   Total
3                      Amazonas   30983     2564   56631
4                          Pará  128589    11919  247779
5                      Maranhão  141942    14215  284101
6                         Piauí   90322     8810  178427
7                         Ceará  350906    33886  689773

In [8]:
columns_multiindex = pd.MultiIndex.from_tuples([
    #('Gêneros', 'Províncias e Município Neutro'),
    ('', 'Províncias e Município Neutro'),
    ('Gêneros', 'Homens'),
    ('Gêneros', 'Mulheres'),
    ('Gêneros', 'Total')
])

# Atribuindo o MultiIndex às colunas do DataFrame
sexos.columns = columns_multiindex

#print(sexos)
sexos

                                  Gêneros
   Províncias e Município Neutro   Homens Mulheres    Total
3                       Amazonas    30983     2564    56631
4                           Pará   128589    11919   247779
5                       Maranhão   141942    14215   284101
6                          Piauí    90322     8810   178427
7                          Ceará   350906    33886   689773
8            Rio Grande do Norte   112721    10823   220959
9                        Paraíba   179433    17526   354700
10                    Pernambuco   381565    37094   752511
11                       Alagoas   155584    15667   312268
12                       Sergipe    74739     7888   153620
13                         Bahia   630353    58143  1211792
14                Espírito Santo    29607    29871    59478
15              Município Neutro   133880    92153   226033
16                Rio de Janeiro   255806   234281   499087
17                     São Paulo   348304   332438   680742
18                        Paraná    59384    56858   116162
19                Santa Catarina    73088    71730   144818
20             Rio Grande do Sul   191022   176000   367022
21                  Minas Gerais   847592   821684  1669276
22                         Goiás    74968    74775   149743
23                   Mato Grosso    27991    25759    53750
24                         Total  4318699  4100973  8419672

In [9]:
colunas_sexos = [('Gêneros', 'Homens'), ('Gêneros', 'Mulheres'), ('Gêneros', 'Total')]
sexos[colunas_sexos] = sexos[colunas_sexos].apply(pd.to_numeric)

total_homens = sexos.iloc[21,1]
total_mulheres = sexos.iloc[21,2]
total = sexos.iloc[21,3]

soma_homens = sexos[('Gêneros', 'Homens')].sum() - total_homens
soma_mulheres = sexos[('Gêneros', 'Mulheres')].sum() - total_mulheres
soma_total = sexos[('Gêneros', 'Total')].sum() - total


if soma_homens == total_homens:
    soma_homens
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores")
    print("Digitado na tabela: " + str(total_homens))
    print("Valor da soma: " + str(soma_homens))
    print("Diferença: " + str(soma_homens - total_homens))

if soma_mulheres == total_mulheres:
    total_mulheres
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores")
    print("Digitado na tabela: " + str(total_mulheres))
    print("Valor da soma: " + str(soma_mulheres))
    print("Diferença: " + str(soma_mulheres - total_mulheres))

#valores digitados na coluna de mulheres contém vários erros de digitação. a maior parte dos valores estão faltando o último dígito (a casa de unidade)

if soma_total == total:
    total
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores")
    print("Digitado na tabela: " + str(total))
    print("Valor da soma: " + str(soma_total))
    print("Diferença: " + str(soma_total - total))

Discrepância entre valor digitado na tabela e soma dos valores
Digitado na tabela: 4318699
Valor da soma: 4318779
Diferença: 80
Discrepância entre valor digitado na tabela e soma dos valores
Digitado na tabela: 4100973
Valor da soma: 2134084
Diferença: -1966889
Discrepância entre valor digitado na tabela e soma dos valores
Digitado na tabela: 8419672
Valor da soma: 8428672
Diferença: 9000

# Estados civis

In [10]:
estados_civis = df[['Unnamed: 0','Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9']]
estados_civis.head()

,Unnamed: 0,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,Estados Civis,NaN,NaN,NaN,NaN,NaN
1,NaN,dos Homens,NaN,NaN,das Mulheres,NaN,NaN
2,Províncias e Município Neutro,Solteiros,Casados,Viúvos,Solteiras,Casadas,Viúvas
3,Amazonas,24959,5105,919,19214,4714,1720
4,Pará,94848,28935,4806,86825,26280,6085

In [11]:
estados_civis_header = estados_civis.iloc[2]
estados_civis.columns = estados_civis_header
estados_civis = estados_civis[3:]
estados_civis.head()

2,Províncias e Município Neutro,Solteiros,Casados,Viúvos,Solteiras,Casadas,Viúvas
3,Amazonas,24959,5105,919,19214,4714,1720
4,Pará,94848,28935,4806,86825,26280,6085
5,Maranhão,103283,33644,5015,102302,32337,7520
6,Piauí,63294,23323,3705,59547,23371,5187
7,Ceará,241692,99915,9299,224509,99849,14509

In [12]:
columns_multiindex = pd.MultiIndex.from_tuples([
    #('Gêneros', 'Províncias e Município Neutro'),
    ('', '', 'Províncias e Município Neutro'),
    ('Estados civis', 'dos Homens', 'Solteiros'),
    ('Estados civis', 'dos Homens', 'Casados'),
    ('Estados civis', 'dos Homens', 'Viúvos'),
    ('Estados civis', 'das Mulheres', 'Solteiras'),
    ('Estados civis', 'das Mulheres', 'Casadas'),
    ('Estados civis', 'das Mulheres', 'Viúvas')
])

# Atribuindo o MultiIndex às colunas do DataFrame
estados_civis.columns = columns_multiindex

estados_civis

                                 Estados civis                                \
                                    dos Homens                  das Mulheres
   Províncias e Município Neutro     Solteiros  Casados  Viúvos    Solteiras
3                       Amazonas         24959     5105     919        19214
4                           Pará         94848    28935    4806        86825
5                       Maranhão        103283    33644    5015       102302
6                          Piauí         63294    23323    3705        59547
7                          Ceará        241692    99915    9299       224509
8            Rio Grande do Norte         80803    26832    5086        75915
9                        Paraíba        119403    53474    6556       112332
10                    Pernambuco        258936   111189   11440       240239
11                       Alagoas        102729    47865    4990        99772
12                       Sergipe         48013    24027    2699        50746
13                         Bahia        440556   160204   29593       398473
14                Espírito Santo         19415     9298     894        19251
15              Município Neutro        104036    25763    4081        64074
16                Rio de Janeiro        168391    71842   15573       148840
17                     São Paulo        234386    98864   15054       218684
18                        Paraná         37977    18649    2678        35006
19                Santa Catarina         49985    21351    1752        47122
20             Rio Grande do Sul        139899    45104    6019       124864
21                  Minas Gerais        572728   231947   42917       557389
22                         Goiás         51886    20696    2386        50125
23                   Mato Grosso         18227     7839    1925        17353
24                         Total       2975446  1165866  177387      2752582



    Casadas  Viúvas
3      4714    1720
4     26280    6085
5     32337    7520
6     23371    5187
7     99849   14509
8     26735    5588
9     53274    9661
10   111465   19242
11    46743   10169
12    24795    3340
13   151883   31083
14     9449    1171
15    20174    7905
16    68726   16715
17    96290   17464
18    18332    3520
19    20412    4196
20    41525    9611
21   217353   46942
22    20340    4310
23     6953    1453
24  1121000  227391

In [13]:
colunas_estados_civis = [('Estados civis', 'dos Homens', 'Solteiros'),
    ('Estados civis', 'dos Homens', 'Casados'),
    ('Estados civis', 'dos Homens', 'Viúvos'),
    ('Estados civis', 'das Mulheres', 'Solteiras'),
    ('Estados civis', 'das Mulheres', 'Casadas'),
    ('Estados civis', 'das Mulheres', 'Viúvas')]
estados_civis[colunas_estados_civis] = estados_civis[colunas_estados_civis].apply(pd.to_numeric)



total_solteiros = estados_civis.iloc[21,1]
total_casados = estados_civis.iloc[21,2]
total_viuvos = estados_civis.iloc[21,3]

total_homens = total_solteiros + total_casados + total_viuvos

total_solteiras = estados_civis.iloc[21,4]
total_casadas = estados_civis.iloc[21,5]
total_viuvas = estados_civis.iloc[21,6]

total_mulheres = total_solteiras + total_casadas + total_viuvas

soma_solteiros = estados_civis[('Estados civis', 'dos Homens', 'Solteiros')].sum() - total_solteiros
soma_casados = estados_civis[('Estados civis', 'dos Homens', 'Casados')].sum() - total_casados
soma_viuvos = estados_civis[('Estados civis', 'dos Homens', 'Viúvos')].sum() - total_viuvos

soma_homens = soma_solteiros + soma_casados + soma_viuvos


soma_solteiras = estados_civis[('Estados civis', 'das Mulheres', 'Solteiras')].sum() - total_solteiras
soma_casadas = estados_civis[('Estados civis', 'das Mulheres', 'Casadas')].sum() - total_casadas
soma_viuvas = estados_civis[('Estados civis', 'das Mulheres', 'Viúvas')].sum() - total_viuvas

soma_mulheres = soma_solteiras + soma_casadas + soma_viuvas


if soma_homens == total_homens:
    soma_homens
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores")
    print("Digitado na tabela: " + str(total_homens))
    print("Valor da soma: " + str(soma_homens))
    print("Diferença: " + str(soma_homens - total_homens))

if soma_mulheres == total_mulheres:
    total_mulheres
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores")
    print("Digitado na tabela: " + str(total_mulheres))
    print("Valor da soma: " + str(soma_mulheres))
    print("Diferença: " + str(soma_mulheres - total_mulheres))


if soma_total == total:
    total
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores")
    print("Digitado na tabela: " + str(total))
    print("Valor da soma: " + str(soma_total))
    print("Diferença: " + str(soma_total - total))

#problema na soma total se repete, provavelmente devido a um erro de digitação na tabela

Discrepância entre valor digitado na tabela e soma dos valores
Digitado na tabela: 8419672
Valor da soma: 8428672
Diferença: 9000

# Raças

In [14]:
racas = df[['Unnamed: 0','Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13', 'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17']]
racas.head()

,Unnamed: 0,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17
0,NaN,Raças,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,dos Homens,NaN,NaN,NaN,das Mulheres,NaN,NaN,NaN
2,Províncias e Município Neutro,Brancos,Pardos,Pretos,Caboclos,Brancas,Pardas,Pretas,Caboclas
3,Amazonas,6911,4210,711,19151,4300,3046,625,17677
4,Pará,49663,46899,9200,22827,42971,46828,7629,21762

In [15]:
racas_header = racas.iloc[2]
racas.columns = racas_header
racas = racas[3:]
racas.head()

2,Províncias e Município Neutro,Brancos,Pardos,Pretos,Caboclos,Brancas,Pardas,Pretas,Caboclas
3,Amazonas,6911,4210,711,19151,4300,3046,625,17677
4,Pará,49663,46899,9200,22827,42971,46828,7629,21762
5,Maranhão,52267,71662,12504,5509,51246,72699,12780,5434
6,Piauí,22208,53474,7505,7135,21239,53191,7357,6318
7,Ceará,136940,172841,14424,26701,131896,166325,14510,26136

In [16]:
columns_multiindex = pd.MultiIndex.from_tuples([
    ('', '', 'Províncias e Município Neutro'),
    ('Raças', 'dos Homens', 'Brancos'),
    ('Raças', 'dos Homens', 'Pardos'),
    ('Raças', 'dos Homens', 'Pretos'),
    ('Raças', 'dos Homens', 'Caboclos'),
    ('Raças', 'das Mulheres', 'Brancas'),
    ('Raças', 'das Mulheres', 'Pardas'),
    ('Raças', 'das Mulheres', 'Pretas'),
    ('Raças', 'das Mulheres', 'Caboclas')
])

racas.columns = columns_multiindex

racas

                                      Raças                            \
                                 dos Homens
   Províncias e Município Neutro    Brancos   Pardos  Pretos Caboclos
3                       Amazonas       6911     4210     711    19151
4                           Pará      49663    46899    9200    22827
5                       Maranhão      52267    71662   12504     5509
6                          Piauí      22208    53474    7505     7135
7                          Ceará     136940   172841   14424    26701
8            Rio Grande do Norte      52835    42213   12202     5471
9                        Paraíba      73475    89921   11155     4882
10                    Pernambuco     149930   194897   30795     5943
11                       Alagoas      45343    98916    8220     3105
12                       Sergipe      24358    39524    9321     1536
13                         Bahia     178605   287131  137574    27043
14                Espírito Santo      13555     9648    3395     3009
15              Município Neutro      96255    22762   14198      665
16                Rio de Janeiro     160595    61542   29517     4152
17                     São Paulo     221260    76288   29512    21244
18                        Paraná      35936    15358    3292     4718
19                Santa Catarina      63502     5941    2199     1446
20             Rio Grande do Sul     136094    24487   17828    12613
21                  Minas Gerais     421861   302948  105507    17276
22                         Goiás      21152    42482    9088     2246
23                   Mato Grosso       9027    10827    3861     4276
24                         Total    1971772  1673971  472008   200948


   das Mulheres
        Brancas   Pardas  Pretas Caboclas
3          4300     3046     625    17677
4         42971    46828    7629    21762
5         51246    72699   12780     5434
6         21239    53191    7357     6318
7        131896   166325   14510    26136
8         49630    41877   11163     5568
9         71246    88675   10661     4685
10       141229   192954   30901     5862
11        43455   101283    8687     3259
12        25420    42059    9851     1551
13       152874   278573  127153    22839
14        13027    10881    3443     2520
15        55544    22083   14268      258
16       142680    59703   28198     3700
17       212172    75018   27027    18221
18        33762    15278    3449     4369
19        62440     5796    2048     1446
20       122273    24179   16444    13104
21       409126   295865  101647    15046
22        20777    43907    8087     2004
23         8210    10087    3214     4248
24      1815517  1650307  449142   186007

In [17]:
colunas_racas = [('Raças', 'dos Homens', 'Brancos'),
    ('Raças', 'dos Homens', 'Pardos'),
    ('Raças', 'dos Homens', 'Pretos'),
    ('Raças', 'dos Homens', 'Caboclos'),
    ('Raças', 'das Mulheres', 'Brancas'),
    ('Raças', 'das Mulheres', 'Pardas'),
    ('Raças', 'das Mulheres', 'Pretas'),
    ('Raças', 'das Mulheres', 'Caboclas')]
racas[colunas_racas] = racas[colunas_racas].apply(pd.to_numeric)

total_brancos = racas.iloc[21,1]
total_pardos = racas.iloc[21,2]
total_pretos = racas.iloc[21,3]
total_caboclos = racas.iloc[21,4]

total_homens = total_brancos + total_pardos + total_pretos + total_caboclos

total_brancas = racas.iloc[21,5]
total_pardas = racas.iloc[21,6]
total_pretas = racas.iloc[21,7]
total_caboclas = racas.iloc[21,8]

total_mulheres = total_brancas + total_pardas + total_pretas + total_caboclas

soma_brancos = racas[('Raças', 'dos Homens', 'Brancos')].sum() - total_brancos
soma_pardos = racas[('Raças', 'dos Homens', 'Pardos')].sum() - total_pardos
soma_pretos = racas[('Raças', 'dos Homens', 'Pretos')].sum() - total_pretos
soma_caboclos = racas[('Raças', 'dos Homens', 'Caboclos')].sum() - total_caboclos

soma_homens = soma_brancos + soma_pardos + soma_pretos + soma_caboclos


soma_brancas = racas[('Raças', 'das Mulheres', 'Brancas')].sum() - total_brancas
soma_pardas = racas[('Raças', 'das Mulheres', 'Pardas')].sum() - total_pardas
soma_pretas = racas[('Raças', 'das Mulheres', 'Pretas')].sum() - total_pretas
soma_caboclas = racas[('Raças', 'das Mulheres', 'Caboclas')].sum() - total_caboclas

soma_mulheres = soma_brancas + soma_pardas + soma_pretas + soma_caboclas


if soma_homens == total_homens:
    soma_homens
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores de homens")
    print("Digitado na tabela: " + str(total_homens))
    print("Valor da soma: " + str(soma_homens))
    print("Diferença: " + str(soma_homens - total_homens))

if soma_mulheres == total_mulheres:
    total_mulheres
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores de mulheres")
    print("Digitado na tabela: " + str(total_mulheres))
    print("Valor da soma: " + str(soma_mulheres))
    print("Diferença: " + str(soma_mulheres - total_mulheres))


if soma_total == total:
    total
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores totais")
    print("Digitado na tabela: " + str(total))
    print("Valor da soma: " + str(soma_total))
    print("Diferença: " + str(soma_total - total))

#problema na soma total se repete, provavelmente devido a um erro de digitação na tabela

Discrepância entre valor digitado na tabela e soma dos valores totais
Digitado na tabela: 8419672
Valor da soma: 8428672
Diferença: 9000

# Religião

In [18]:
religiao = df[['Unnamed: 0','Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21']]
religiao.head()

,Unnamed: 0,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21
0,NaN,Religião,NaN,NaN,NaN
1,NaN,dos Homens,NaN,das Mulheres,NaN
2,Províncias e Município Neutro,Católicos,Acatólicos,Católicas,Acatólicas
3,Amazonas,30903,80,25641,7
4,Pará,128396,193,119169,21

In [19]:
religiao_header = religiao.iloc[2]
religiao.columns = religiao_header
religiao = religiao[3:]
religiao.head()

2 Províncias e Município Neutro Católicos Acatólicos Católicas Acatólicas
3                      Amazonas     30903         80     25641          7
4                          Pará    128396        193    119169         21
5                      Maranhão    141865         77    142100         59
6                         Piauí     90313          9     88105          0
7                         Ceará    350868         38    338857         10

In [20]:
columns_multiindex = pd.MultiIndex.from_tuples([
    ('', '', 'Províncias e Município Neutro'),
    ('Religião', 'dos Homens', 'Católicos'),
    ('Religião', 'dos Homens', 'Acatólicos'),
    ('Religião', 'das Mulheres', 'Católicas'),
    ('Religião', 'das Mulheres', 'Acatólicas')
])

religiao.columns = columns_multiindex

religiao

                                   Religião
                                 dos Homens            das Mulheres
   Províncias e Município Neutro  Católicos Acatólicos    Católicas Acatólicas
3                       Amazonas      30903         80        25641          7
4                           Pará     128396        193       119169         21
5                       Maranhão     141865         77       142100         59
6                          Piauí      90313          9        88105          0
7                          Ceará     350868         38       338857         10
8            Rio Grande do Norte     112717          4       108238          0
9                        Paraíba     179429          4       175266          1
10                    Pernambuco     381361        204       370906         40
11                       Alagoas     155557         27       156683          1
12                       Sergipe      74739          0        78881          0
13                         Bahia     630196        157       581384         55
14                Espírito Santo      29377        230        29687        184
15              Município Neutro     132552       1328        91553        600
16                Rio de Janeiro     255433        373       234066        215
17                     São Paulo     346326       1973       331217       1221
18                        Paraná      58755        549        56594        264
19                Santa Catarina      67635       5453        66742       4988
20             Rio Grande do Sul     187182       3840       173617       2383
21                  Minas Gerais     845840       1752       820290       1394
22                         Goiás      74967          1        74775          0
23                   Mato Grosso      27975         16        25749         10
24                         Total    4302386      16313      4089520      11453

In [21]:
colunas_religiao = [('Religião', 'dos Homens', 'Católicos'),
    ('Religião', 'dos Homens', 'Acatólicos'),
    ('Religião', 'das Mulheres', 'Católicas'),
    ('Religião', 'das Mulheres', 'Acatólicas')]
religiao[colunas_religiao] = religiao[colunas_religiao].apply(pd.to_numeric)

total_catolicos = religiao.iloc[21,1]
total_acatolicos = religiao.iloc[21,2]

total_homens = total_catolicos + total_acatolicos

total_catolicas = religiao.iloc[21,3]
total_acatolicas = religiao.iloc[21,4]

total_mulheres = total_catolicas + total_acatolicas

soma_catolicos = religiao[('Religião', 'dos Homens', 'Católicos')].sum() - total_catolicos
soma_acatolicos = religiao[('Religião', 'dos Homens', 'Acatólicos')].sum() - total_acatolicos

soma_homens = soma_catolicos + soma_acatolicos


soma_catolicas = religiao[('Religião', 'das Mulheres', 'Católicas')].sum() - total_catolicas
soma_acatolicas = religiao[('Religião', 'das Mulheres', 'Acatólicas')].sum() - total_acatolicas

soma_mulheres = soma_catolicas + soma_acatolicas


if soma_homens == total_homens:
    soma_homens
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores de homens")
    print("Digitado na tabela: " + str(total_homens))
    print("Valor da soma: " + str(soma_homens))
    print("Diferença: " + str(soma_homens - total_homens))

if soma_mulheres == total_mulheres:
    total_mulheres
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores de mulheres")
    print("Digitado na tabela: " + str(total_mulheres))
    print("Valor da soma: " + str(soma_mulheres))
    print("Diferença: " + str(soma_mulheres - total_mulheres))


if soma_total == total:
    total
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores totais")
    print("Digitado na tabela: " + str(total))
    print("Valor da soma: " + str(soma_total))
    print("Diferença: " + str(soma_total - total))

#problema na soma total se repete, provavelmente devido a um erro de digitação na tabela
#averiguar a diferença na soma dos homens

Discrepância entre valor digitado na tabela e soma dos valores de homens
Digitado na tabela: 4318699
Valor da soma: 4318694
Diferença: -5
Discrepância entre valor digitado na tabela e soma dos valores totais
Digitado na tabela: 8419672
Valor da soma: 8428672
Diferença: 9000

# Nacionalidades

In [22]:
nacionalidade = df[['Unnamed: 0','Unnamed: 22', 'Unnamed: 23', 'Unnamed: 24', 'Unnamed: 25']]
nacionalidade.head()

,Unnamed: 0,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25
0,NaN,Nacionalidades,NaN,NaN,NaN
1,NaN,dos Homens,NaN,das Mulheres,NaN
2,Províncias e Município Neutro,Brasileiros,Estrangeiros,Brasileiras,Estrangeiras
3,Amazonas,29223,1760,25222,426
4,Pará,123365,5224,118437,753

In [23]:
nacionalidade_header = nacionalidade.iloc[2]
nacionalidade.columns = nacionalidade_header
nacionalidade = nacionalidade[3:]
nacionalidade.head()

2,Províncias e Município Neutro,Brasileiros,Estrangeiros,Brasileiras,Estrangeiras
3,Amazonas,29223,1760,25222,426
4,Pará,123365,5224,118437,753
5,Maranhão,139413,2529,141191,968
6,Piauí,90022,300,88001,104
7,Ceará,349805,1101,338475,392

In [24]:
columns_multiindex = pd.MultiIndex.from_tuples([
    ('', '', 'Províncias e Município Neutro'),
    ('Nacionalidades', 'dos Homens', 'Brasileiros'),
    ('Nacionalidades', 'dos Homens', 'Estrangeiros'),
    ('Nacionalidades', 'das Mulheres', 'Brasileiras'),
    ('Nacionalidades', 'das Mulheres', 'Estrangeiras')
])

nacionalidade.columns = columns_multiindex

nacionalidade

                                 Nacionalidades                            \
                                     dos Homens              das Mulheres
   Províncias e Município Neutro    Brasileiros Estrangeiros  Brasileiras
3                       Amazonas          29223         1760        25222
4                           Pará         123365         5224       118437
5                       Maranhão         139413         2529       141191
6                          Piauí          90022          300        88001
7                          Ceará         349805         1101       338475
8            Rio Grande do Norte         112305          416       108078
9                        Paraíba         178940          493       175102
10                    Pernambuco         373530         8035       368621
11                       Alagoas         154606          978       156321
12                       Sergipe          74352          387        78723
13                         Bahia         622447         7906       577229
14                Espírito Santo          28190         1417        29359
15              Município Neutro          77872        56008        74851
16                Rio de Janeiro         225843        29963       225860
17                     São Paulo         336473        11831       327702
18                        Paraná          57224         2080        56049
19                Santa Catarina          64731         8357        65241
20             Rio Grande do Sul         166042        24980       164522
21                  Minas Gerais         833175        14417       817692
22                         Goiás          74818          150        74698
23                   Mato Grosso          26986         1005        25455
24                         Total        4139362       179337      4036829



   Estrangeiras
3           426
4           753
5           968
6           104
7           392
8           160
9           165
10         2325
11          363
12          158
13         4210
14          512
15        17302
16         8421
17         4736
18          809
19         6489
20        11478
21         3992
22           77
23          304
24        64144

In [25]:
colunas_nacionalidade = [('Nacionalidades', 'dos Homens', 'Brasileiros'),
    ('Nacionalidades', 'dos Homens', 'Estrangeiros'),
    ('Nacionalidades', 'das Mulheres', 'Brasileiras'),
    ('Nacionalidades', 'das Mulheres', 'Estrangeiras')]
nacionalidade[colunas_nacionalidade] = nacionalidade[colunas_nacionalidade].apply(pd.to_numeric)

total_brasileiros = nacionalidade.iloc[21,1]
total_estrangeiros = nacionalidade.iloc[21,2]

total_homens = total_brasileiros + total_estrangeiros

total_brasileiras = nacionalidade.iloc[21,3]
total_estrangeiras = nacionalidade.iloc[21,4]

total_mulheres = total_brasileiras + total_estrangeiras

soma_brasileiros = nacionalidade[('Nacionalidades', 'dos Homens', 'Brasileiros')].sum() - total_brasileiros
soma_estrangeiros = nacionalidade[('Nacionalidades', 'dos Homens', 'Estrangeiros')].sum() - total_estrangeiros

soma_homens = soma_brasileiros + soma_estrangeiros


soma_brasileiras = nacionalidade[('Nacionalidades', 'das Mulheres', 'Brasileiras')].sum() - total_brasileiras
soma_estrangeiras = nacionalidade[('Nacionalidades', 'das Mulheres', 'Estrangeiras')].sum() - total_estrangeiras

soma_mulheres = soma_brasileiras + soma_estrangeiras


if soma_homens == total_homens:
    soma_homens
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores de homens")
    print("Digitado na tabela: " + str(total_homens))
    print("Valor da soma: " + str(soma_homens))
    print("Diferença: " + str(soma_homens - total_homens))

if soma_mulheres == total_mulheres:
    total_mulheres
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores de mulheres")
    print("Digitado na tabela: " + str(total_mulheres))
    print("Valor da soma: " + str(soma_mulheres))
    print("Diferença: " + str(soma_mulheres - total_mulheres))


if soma_total == total:
    total
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores totais")
    print("Digitado na tabela: " + str(total))
    print("Valor da soma: " + str(soma_total))
    print("Diferença: " + str(soma_total - total))

#problema na soma total se repete, provavelmente devido a um erro de digitação na tabela

Discrepância entre valor digitado na tabela e soma dos valores totais
Digitado na tabela: 8419672
Valor da soma: 8428672
Diferença: 9000

# Grau de instrução

In [26]:
instrucao = df[['Unnamed: 0','Instrução', 'Unnamed: 27', 'Unnamed: 28', 'Unnamed: 29', 'Unnamed: 30', 'Unnamed: 31', 'Unnamed: 32', 'Unnamed: 33', 'Unnamed: 34', 'Unnamed: 35']]
instrucao.head()

,Unnamed: 0,Instrução,Unnamed: 27,Unnamed: 28,Unnamed: 29,Unnamed: 30,Unnamed: 31,Unnamed: 32,Unnamed: 33,Unnamed: 34,Unnamed: 35
0,NaN,NaN,NaN,NaN,NaN,População escolar de 6 a 15 anos,NaN,NaN,NaN,NaN,NaN
1,NaN,Homens,NaN,Mulheres,NaN,Meninos,NaN,NaN,Meninas,NaN,NaN
2,Províncias e Município Neutro,Sabem ler e escrever,Analfabetos,Sabem ler e escrever,Analfabetas,Frequentam escolas,Não frequentam,Total,Frequentam escolas,Não frequentam,Total
3,Amazonas,6160,24823,1453,24195,824,5056,5880,371,3269,3640
4,Pará,39718,88871,20677,98513,5768,25753,31521,3441,25020,28461

In [27]:
instrucao_header = instrucao.iloc[2]
instrucao.columns = instrucao_header
instrucao = instrucao[3:]
instrucao.head()

2,Províncias e Município Neutro,Sabem ler e escrever,Analfabetos,Sabem ler e escrever,Analfabetas,Frequentam escolas,Não frequentam,Total,Frequentam escolas,Não frequentam,Total
3,Amazonas,6160,24823,1453,24195,824,5056,5880,371,3269,3640
4,Pará,39718,88871,20677,98513,5768,25753,31521,3441,25020,28461
5,Maranhão,44375,97567,24196,117963,8739,28142,36881,4844,29567,34411
6,Piauí,17677,72645,10093,78012,1777,15960,17737,1024,16968,17992
7,Ceará,58657,292249,20903,317964,10021,83808,93829,5399,85087,90486

In [28]:
columns_multiindex = pd.MultiIndex.from_tuples([
    ('', '', '', 'Províncias e Município Neutro'),
    ('Instrução', '', 'Homens', 'Sabem ler e escrever'),
    ('Instrução', '', 'Homens', 'Analfabetos'),
    ('Instrução', '', 'Mulheres', 'Sabem ler e escrever'),
    ('Instrução', '', 'Mulheres', 'Analfabetas'),
    ('Instrução', 'População escolar de 6 a 15 anos', 'Meninos', 'Frequentam escolas'),
    ('Instrução', 'População escolar de 6 a 15 anos', 'Meninos', 'Não frequentam'),
    ('Instrução', 'População escolar de 6 a 15 anos', 'Meninos', 'Total'),
    ('Instrução', 'População escolar de 6 a 15 anos', 'Meninas', 'Frequentam escolas'),
    ('Instrução', 'População escolar de 6 a 15 anos', 'Meninas', 'Não frequentam'),
    ('Instrução', 'População escolar de 6 a 15 anos', 'Meninas', 'Total')
])

instrucao.columns = columns_multiindex

instrucao

                                            Instrução              \

                                               Homens
   Províncias e Município Neutro Sabem ler e escrever Analfabetos
3                       Amazonas                 6160       24823
4                           Pará                39718       88871
5                       Maranhão                44375       97567
6                          Piauí                17677       72645
7                          Ceará                58657      292249
8            Rio Grande do Norte                23602       39119
9                        Paraíba                29224      150209
10                    Pernambuco                92664      288901
11                       Alagoas                26046      129538
12                       Sergipe                18687       56052
13                         Bahia               161937      468416
14                Espírito Santo                 7229       22378
15              Município Neutro                65164       68714
16                Rio de Janeiro                69997      185809
17                     São Paulo                92977      255327
18                        Paraná                19014       40299
19                Santa Catarina                12927       59161
20             Rio Grande do Sul                 5592      134060
21                  Minas Gerais               145297      702295
22                         Goiás                15699       59299
23                   Mato Grosso                 7114       20877
24                         Total              1012097     3306602

                                                                      \
                                    População escolar de 6 a 15 anos
               Mulheres                                      Meninos
   Sabem ler e escrever Analfabetas               Frequentam escolas
3                  1453       24195                              824
4                 20677       98513                             5768
5                 24196      117963                             8739
6                 10093       78012                             1777
7                 20903      317964                            10021
8                 16220       92018                             2643
9                 11988      163279                             6630
10                54659      316287                            14069
11                15814      140870                             5455
12                10447       68434                             3402
13                37135      494304                            22260
14                 2503       27368                             1564
15                33992       58101                             5788
16                44603      189678                            12622
17                48090      284348                            15069
18                12802       44056                             2558
19                 7999       63731                             3100
20                38341      137659                             9947
21                78271      743413                            19968
22                 6987       67788                             2566
23                 3808       21951                              881
24               550981     3549992                           155651



                                     Meninas
   Não frequentam   Total Frequentam escolas Não frequentam   Total
3            5056    5880                371           3269    3640
4           25753   31521               3441          25020   28461
5           28142   36881               4844          29567   34411
6           15960   17737               1024          16968   17992
7           83808   93829               5399          85087   90486
8           18662   21305               2058          19857   21915
9           44061   50691               3894          45830   49724
10          82133   96202               9301          80960   90261
11          34261   39716               4028          34726   38754
12          14934   18336               1832          17333   19165
13         119426  141686              81743         113313  195056
14           5323    6887                722           5101    6823
15          10449   22237               4258          15019   19277
16          32019   44641               8194          33089   41283
17          71271   86340               8544          73915   82458
18           9666   12224               1866          10762   12628
19          15676   18776               2114          15473   17587
20          36222   46169               7947          33292   41239
21          66983  125012              11940         112824  124764
22          16864   19430               1240          16982   18222
23           5401    6282                338           6187    6525
24         786131  941782             165098         795574  960672

# Grau de instrução (adultos)

In [29]:
instrucao_adultos = df[['Unnamed: 0','Instrução', 'Unnamed: 27', 'Unnamed: 28', 'Unnamed: 29']]
instrucao_adultos.head()

,Unnamed: 0,Instrução,Unnamed: 27,Unnamed: 28,Unnamed: 29
0,NaN,NaN,NaN,NaN,NaN
1,NaN,Homens,NaN,Mulheres,NaN
2,Províncias e Município Neutro,Sabem ler e escrever,Analfabetos,Sabem ler e escrever,Analfabetas
3,Amazonas,6160,24823,1453,24195
4,Pará,39718,88871,20677,98513

In [30]:
instrucao_adultos_header = instrucao_adultos.iloc[2]
instrucao_adultos.columns = instrucao_adultos_header
instrucao_adultos = instrucao_adultos[3:]
instrucao_adultos.head()

2,Províncias e Município Neutro,Sabem ler e escrever,Analfabetos,Sabem ler e escrever,Analfabetas
3,Amazonas,6160,24823,1453,24195
4,Pará,39718,88871,20677,98513
5,Maranhão,44375,97567,24196,117963
6,Piauí,17677,72645,10093,78012
7,Ceará,58657,292249,20903,317964

In [31]:
columns_multiindex = pd.MultiIndex.from_tuples([
    ('', '', 'Províncias e Município Neutro'),
    ('Instrução', 'Homens', 'Sabem ler e escrever'),
    ('Instrução', 'Homens', 'Analfabetos'),
    ('Instrução', 'Mulheres', 'Sabem ler e escrever'),
    ('Instrução', 'Mulheres', 'Analfabetas')
])

instrucao_adultos.columns = columns_multiindex

instrucao_adultos

                                            Instrução              \
                                               Homens
   Províncias e Município Neutro Sabem ler e escrever Analfabetos
3                       Amazonas                 6160       24823
4                           Pará                39718       88871
5                       Maranhão                44375       97567
6                          Piauí                17677       72645
7                          Ceará                58657      292249
8            Rio Grande do Norte                23602       39119
9                        Paraíba                29224      150209
10                    Pernambuco                92664      288901
11                       Alagoas                26046      129538
12                       Sergipe                18687       56052
13                         Bahia               161937      468416
14                Espírito Santo                 7229       22378
15              Município Neutro                65164       68714
16                Rio de Janeiro                69997      185809
17                     São Paulo                92977      255327
18                        Paraná                19014       40299
19                Santa Catarina                12927       59161
20             Rio Grande do Sul                 5592      134060
21                  Minas Gerais               145297      702295
22                         Goiás                15699       59299
23                   Mato Grosso                 7114       20877
24                         Total              1012097     3306602


               Mulheres
   Sabem ler e escrever Analfabetas
3                  1453       24195
4                 20677       98513
5                 24196      117963
6                 10093       78012
7                 20903      317964
8                 16220       92018
9                 11988      163279
10                54659      316287
11                15814      140870
12                10447       68434
13                37135      494304
14                 2503       27368
15                33992       58101
16                44603      189678
17                48090      284348
18                12802       44056
19                 7999       63731
20                38341      137659
21                78271      743413
22                 6987       67788
23                 3808       21951
24               550981     3549992

In [32]:
colunas_instrucao_adultos = [('Instrução', 'Homens', 'Sabem ler e escrever'),
    ('Instrução', 'Homens', 'Analfabetos'),
    ('Instrução', 'Mulheres', 'Sabem ler e escrever'),
    ('Instrução', 'Mulheres', 'Analfabetas')]
instrucao_adultos[colunas_instrucao_adultos] = instrucao_adultos[colunas_instrucao_adultos].apply(pd.to_numeric)

total_alfabetizados = instrucao_adultos.iloc[21,1]
total_analfabetos = instrucao_adultos.iloc[21,2]

total_homens = total_alfabetizados + total_analfabetos

total_alfabetizadas = instrucao_adultos.iloc[21,3]
total_analfabetas = instrucao_adultos.iloc[21,4]

total_mulheres = total_alfabetizadas + total_analfabetas

soma_alfabetizados = instrucao_adultos[('Instrução', 'Homens', 'Sabem ler e escrever')].sum() - total_alfabetizados
soma_analfabetos = instrucao_adultos[('Instrução', 'Homens', 'Analfabetos')].sum() - total_analfabetos

soma_homens = soma_alfabetizados + soma_analfabetos


soma_alfabetizadas = instrucao_adultos[('Instrução', 'Mulheres', 'Sabem ler e escrever')].sum() - total_alfabetizadas
soma_analfabetas = instrucao_adultos[('Instrução', 'Mulheres', 'Analfabetas')].sum() - total_analfabetas

soma_mulheres = soma_alfabetizadas + soma_analfabetas


if soma_homens == total_homens:
    soma_homens
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores de homens")
    print("Digitado na tabela: " + str(total_homens))
    print("Valor da soma: " + str(soma_homens))
    print("Diferença: " + str(soma_homens - total_homens))

if soma_mulheres == total_mulheres:
    total_mulheres
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores de mulheres")
    print("Digitado na tabela: " + str(total_mulheres))
    print("Valor da soma: " + str(soma_mulheres))
    print("Diferença: " + str(soma_mulheres - total_mulheres))


if soma_total == total:
    total
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores totais")
    print("Digitado na tabela: " + str(total))
    print("Valor da soma: " + str(soma_total))
    print("Diferença: " + str(soma_total - total))

#problema na soma total se repete, provavelmente devido a um erro de digitação na tabela
#averiguar a diferença na soma dos homens

Discrepância entre valor digitado na tabela e soma dos valores de homens
Digitado na tabela: 4318699
Valor da soma: 4216366
Diferença: -102333
Discrepância entre valor digitado na tabela e soma dos valores de mulheres
Digitado na tabela: 4100973
Valor da soma: 4050913
Diferença: -50060
Discrepância entre valor digitado na tabela e soma dos valores totais
Digitado na tabela: 8419672
Valor da soma: 8428672
Diferença: 9000

# Grau de instrução (jovens)

In [33]:
instrucao_jovens = df[['Unnamed: 0', 'Unnamed: 30', 'Unnamed: 31', 'Unnamed: 32', 'Unnamed: 33', 'Unnamed: 34', 'Unnamed: 35']]
instrucao_jovens.head()

,Unnamed: 0,Unnamed: 30,Unnamed: 31,Unnamed: 32,Unnamed: 33,Unnamed: 34,Unnamed: 35
0,NaN,População escolar de 6 a 15 anos,NaN,NaN,NaN,NaN,NaN
1,NaN,Meninos,NaN,NaN,Meninas,NaN,NaN
2,Províncias e Município Neutro,Frequentam escolas,Não frequentam,Total,Frequentam escolas,Não frequentam,Total
3,Amazonas,824,5056,5880,371,3269,3640
4,Pará,5768,25753,31521,3441,25020,28461

In [34]:
instrucao_jovens_header = instrucao_jovens.iloc[2]
instrucao_jovens.columns = instrucao_jovens_header
instrucao_jovens = instrucao_jovens[3:]
instrucao_jovens.head()

2,Províncias e Município Neutro,Frequentam escolas,Não frequentam,Total,Frequentam escolas,Não frequentam,Total
3,Amazonas,824,5056,5880,371,3269,3640
4,Pará,5768,25753,31521,3441,25020,28461
5,Maranhão,8739,28142,36881,4844,29567,34411
6,Piauí,1777,15960,17737,1024,16968,17992
7,Ceará,10021,83808,93829,5399,85087,90486

In [35]:
columns_multiindex = pd.MultiIndex.from_tuples([
    ('', '', '', 'Províncias e Município Neutro'),
    ('Instrução', 'População escolar de 6 a 15 anos', 'Meninos', 'Frequentam escolas'),
    ('Instrução', 'População escolar de 6 a 15 anos', 'Meninos', 'Não frequentam'),
    ('Instrução', 'População escolar de 6 a 15 anos', 'Meninos', 'Total'),
    ('Instrução', 'População escolar de 6 a 15 anos', 'Meninas', 'Frequentam escolas'),
    ('Instrução', 'População escolar de 6 a 15 anos', 'Meninas', 'Não frequentam'),
    ('Instrução', 'População escolar de 6 a 15 anos', 'Meninas', 'Total')
])

instrucao_jovens.columns = columns_multiindex

instrucao_jovens

                                                        Instrução  \
                                 População escolar de 6 a 15 anos
                                                          Meninos
   Províncias e Município Neutro               Frequentam escolas
3                       Amazonas                              824
4                           Pará                             5768
5                       Maranhão                             8739
6                          Piauí                             1777
7                          Ceará                            10021
8            Rio Grande do Norte                             2643
9                        Paraíba                             6630
10                    Pernambuco                            14069
11                       Alagoas                             5455
12                       Sergipe                             3402
13                         Bahia                            22260
14                Espírito Santo                             1564
15              Município Neutro                             5788
16                Rio de Janeiro                            12622
17                     São Paulo                            15069
18                        Paraná                             2558
19                Santa Catarina                             3100
20             Rio Grande do Sul                             9947
21                  Minas Gerais                            19968
22                         Goiás                             2566
23                   Mato Grosso                              881
24                         Total                           155651



                                     Meninas
   Não frequentam   Total Frequentam escolas Não frequentam   Total
3            5056    5880                371           3269    3640
4           25753   31521               3441          25020   28461
5           28142   36881               4844          29567   34411
6           15960   17737               1024          16968   17992
7           83808   93829               5399          85087   90486
8           18662   21305               2058          19857   21915
9           44061   50691               3894          45830   49724
10          82133   96202               9301          80960   90261
11          34261   39716               4028          34726   38754
12          14934   18336               1832          17333   19165
13         119426  141686              81743         113313  195056
14           5323    6887                722           5101    6823
15          10449   22237               4258          15019   19277
16          32019   44641               8194          33089   41283
17          71271   86340               8544          73915   82458
18           9666   12224               1866          10762   12628
19          15676   18776               2114          15473   17587
20          36222   46169               7947          33292   41239
21          66983  125012              11940         112824  124764
22          16864   19430               1240          16982   18222
23           5401    6282                338           6187    6525
24         786131  941782             165098         795574  960672

In [36]:
colunas_instrucao_jovens = [('Instrução', 'População escolar de 6 a 15 anos', 'Meninos', 'Frequentam escolas'),
    ('Instrução', 'População escolar de 6 a 15 anos', 'Meninos', 'Não frequentam'),
    ('Instrução', 'População escolar de 6 a 15 anos', 'Meninos', 'Total'),
    ('Instrução', 'População escolar de 6 a 15 anos', 'Meninas', 'Frequentam escolas'),
    ('Instrução', 'População escolar de 6 a 15 anos', 'Meninas', 'Não frequentam'),
    ('Instrução', 'População escolar de 6 a 15 anos', 'Meninas', 'Total')]
instrucao_jovens[colunas_instrucao_jovens] = instrucao_jovens[colunas_instrucao_jovens].apply(pd.to_numeric)

total_meninos_escola = instrucao_jovens.iloc[21,1]
total_meninos_sem_escola = instrucao_jovens.iloc[21,2]
total_meninos = instrucao_jovens.iloc[21,3]

total_homens = total_meninos_escola + total_meninos_sem_escola

if total_homens == total_meninos:
    print("A soma da última linha dos meninos que frequentam e não frequentam escolas está correta")
else:
    print("A soma da última linha dos meninos que frequentam e não frequentam escolas está errada")


total_meninas_escola = instrucao_jovens.iloc[21,4]
total_meninas_sem_escola = instrucao_jovens.iloc[21,5]
total_meninas = instrucao_jovens.iloc[21,6]

total_mulheres = total_meninas_escola + total_meninas_sem_escola

if total_mulheres == total_meninas:
    print("A soma da última linha das meninas que frequentam e não frequentam escolas está correta")
else:
    print("A soma da última linha das meninas que frequentam e não frequentam escolas está errada")

soma_meninos_escola = instrucao_jovens[('Instrução', 'População escolar de 6 a 15 anos', 'Meninos', 'Frequentam escolas')].sum() - total_meninos_escola
soma_meninos_sem_escola = instrucao_jovens[('Instrução', 'População escolar de 6 a 15 anos', 'Meninos', 'Não frequentam')].sum() - total_meninos_sem_escola

soma_homens = soma_meninos_escola + soma_meninos_sem_escola


soma_meninas_escola = instrucao_jovens[('Instrução', 'População escolar de 6 a 15 anos', 'Meninas', 'Frequentam escolas')].sum() - total_meninas_escola
soma_meninas_sem_escola = instrucao_jovens[('Instrução', 'População escolar de 6 a 15 anos', 'Meninas', 'Não frequentam')].sum() - total_meninas_sem_escola

soma_mulheres = soma_meninas_escola + soma_meninas_sem_escola


if soma_homens == total_homens:
    soma_homens
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores de homens")
    print("Digitado na tabela: " + str(total_homens))
    print("Valor da soma: " + str(soma_homens))
    print("Diferença: " + str(soma_homens - total_homens))

if soma_mulheres == total_mulheres:
    total_mulheres
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores de mulheres")
    print("Digitado na tabela: " + str(total_mulheres))
    print("Valor da soma: " + str(soma_mulheres))
    print("Diferença: " + str(soma_mulheres - total_mulheres))


if soma_total == total:
    total
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores totais")
    print("Digitado na tabela: " + str(total))
    print("Valor da soma: " + str(soma_total))
    print("Diferença: " + str(soma_total - total))

#problema na soma total se repete, provavelmente devido a um erro de digitação na tabela
#averiguar a diferença na soma dos homens e mulheres

A soma da última linha dos meninos que frequentam e não frequentam escolas está correta
A soma da última linha das meninas que frequentam e não frequentam escolas está correta
Discrepância entre valor digitado na tabela e soma dos valores de homens
Digitado na tabela: 941782
Valor da soma: 897721
Diferença: -44061
Discrepância entre valor digitado na tabela e soma dos valores de mulheres
Digitado na tabela: 960672
Valor da soma: 959672
Diferença: -1000
Discrepância entre valor digitado na tabela e soma dos valores totais
Digitado na tabela: 8419672
Valor da soma: 8428672
Diferença: 9000

# Casas

In [37]:
casas = df[['Unnamed: 0','Unnamed: 36', 'Unnamed: 37', 'Unnamed: 38']]
casas.head()

                      Unnamed: 0 Unnamed: 36  Unnamed: 37 Unnamed: 38
0                            NaN         NaN          NaN         NaN
1                            NaN       Casas          NaN         NaN
2  Províncias e Município Neutro   Habitadas  Desabitadas       Total
3                       Amazonas        7661          229        7890
4                           Pará       38978         2077       41055

In [38]:
casas_header = casas.iloc[2]
casas.columns = casas_header
casas = casas[3:]
casas.head()

2 Províncias e Município Neutro Habitadas Desabitadas   Total
3                      Amazonas      7661         229    7890
4                          Pará     38978        2077   41055
5                      Maranhão     47166        1405   48571
6                         Piauí     29208         223   29431
7                         Ceará     99901        2989  102890

In [39]:
columns_multiindex = pd.MultiIndex.from_tuples([
    ('', 'Províncias e Município Neutro'),
    ('Casas', 'Habitadas'),
    ('Casas', 'Desabitadas'),
    ('Casas', 'Total')
])

casas.columns = columns_multiindex

casas

                                     Casas
   Províncias e Município Neutro Habitadas Desabitadas    Total
3                       Amazonas      7661         229     7890
4                           Pará     38978        2077    41055
5                       Maranhão     47166        1405    48571
6                          Piauí     29208         223    29431
7                          Ceará     99901        2989   102890
8            Rio Grande do Norte     36710         706    37416
9                        Paraíba     43767         522    44289
10                    Pernambuco    133920        4381   188301
11                       Alagoas     55894        2030    57924
12                       Sergipe     25542         567    26109
13                         Bahia    176032        5479   181511
14                Espírito Santo     10742        1079    11821
15              Município Neutro     29045        1873    80918
16                Rio de Janeiro     88698        2844    91542
17                     São Paulo     65778        1000    66778
18                        Paraná     18903         259    19162
19                Santa Catarina     19608         528    20136
20             Rio Grande do Sul     60199        1741    61940
21                  Minas Gerais    275611        3629   279240
22                         Goiás     25196         487    25683
23                   Mato Grosso      7501         102     7603
24                         Total   1296060       34150  1330210

In [40]:
colunas_casas = [('Casas', 'Habitadas'),
    ('Casas', 'Desabitadas'),
    ('Casas', 'Total')]
casas[colunas_casas] = casas[colunas_casas].apply(pd.to_numeric)

total_habitadas = casas.iloc[21,1]
total_desabitadas = casas.iloc[21,2]
total = casas.iloc[21,3]

soma_habitadas = casas[('Casas', 'Habitadas')].sum() - total_habitadas
soma_desabitadas = casas[('Casas', 'Desabitadas')].sum() - total_desabitadas
soma_total = casas[('Casas', 'Total')].sum() - total


if soma_habitadas == total_habitadas:
    soma_habitadas
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores")
    print("Digitado na tabela: " + str(total_habitadas))
    print("Valor da soma: " + str(soma_habitadas))
    print("Diferença: " + str(soma_habitadas - total_habitadas))

if soma_desabitadas == total_desabitadas:
    total_desabitadas
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores")
    print("Digitado na tabela: " + str(total_desabitadas))
    print("Valor da soma: " + str(soma_desabitadas))
    print("Diferença: " + str(soma_desabitadas - total_desabitadas))

if soma_total == total:
    total
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores")
    print("Digitado na tabela: " + str(total))
    print("Valor da soma: " + str(soma_total))
    print("Diferença: " + str(soma_total - total))

Discrepância entre valor digitado na tabela e soma dos valores
Digitado na tabela: 1330210
Valor da soma: 1430210
Diferença: 100000

# Fogos

In [41]:
fogos = df[['Unnamed: 0', 'Unnamed: 39']]
fogos.head()

                      Unnamed: 0      Unnamed: 39
0                            NaN              NaN
1                            NaN              NaN
2  Províncias e Município Neutro  Número de fogos
3                       Amazonas             7811
4                           Pará            39521

In [42]:
fogos_header = fogos.iloc[2]
fogos.columns = fogos_header
fogos = fogos[3:]
fogos.head()

2 Províncias e Município Neutro Número de fogos
3                      Amazonas            7811
4                          Pará           39521
5                      Maranhão           49282
6                         Piauí           30770
7                         Ceará          100207

In [43]:
colunas_fogos = ['Número de fogos']
fogos[colunas_fogos] = fogos[colunas_fogos].apply(pd.to_numeric)

total_fogos = fogos.iloc[21,1]

soma_fogos = fogos['Número de fogos'].sum() - total_fogos


if soma_fogos == total_fogos:
    print(soma_fogos)
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores")
    print("Digitado na tabela: " + str(total_fogos))
    print("Valor da soma: " + str(soma_fogos))
    print("Diferença: " + str(soma_fogos - total_fogos))

1332274

# Recapitulação

In [44]:
filename = "censo_1872-003_p2.csv"
path = pf.find_file(filename)
df = pd.read_csv(path)

df.head(10)

,Recapitulação,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 30,Unnamed: 31,Unnamed: 32,Unnamed: 33,Unnamed: 34,Unnamed: 35,Unnamed: 36,Unnamed: 37,Unnamed: 38,Unnamed: 39
0,População livre,4318699,4100973,8419672,2975446,1165866,177387,2752582,1121000,227391,...,155651,786131,941782,165098,795574,960672,1296060,34150,1330210,1332274
1,População escrava,805170,705636,1510806,711869,73079,20222,622804,63016,19816,...,155651,786131,941782,165098,795574,960672,1296060,34150,1330210,1332274
2,Total,5123869,4806609,9930478,3687315,1238945,197609,3375386,1184016,247207,...,155651,786131,941782,165098,1332274,960672,1296060,34150,1330210,1332274

In [45]:
print(df.columns)

Index(['Recapitulação', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13',
       'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17',
       'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21',
       'Unnamed: 22', 'Unnamed: 23', 'Unnamed: 24', 'Unnamed: 25',
       'Unnamed: 26', 'Unnamed: 27', 'Unnamed: 28', 'Unnamed: 29',
       'Unnamed: 30', 'Unnamed: 31', 'Unnamed: 32', 'Unnamed: 33',
       'Unnamed: 34', 'Unnamed: 35', 'Unnamed: 36', 'Unnamed: 37',
       'Unnamed: 38', 'Unnamed: 39'],
      dtype='object')

# Sexos

In [46]:
sexos = df[['Recapitulação','Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3']]
sexos = sexos.rename(columns={'Unnamed: 1': 'Homens', 'Unnamed: 2': 'Mulheres', 'Unnamed: 3': 'Total'})
sexos.head()

       Recapitulação   Homens  Mulheres    Total
0    População livre  4318699   4100973  8419672
1  População escrava   805170    705636  1510806
2              Total  5123869   4806609  9930478

In [47]:
colunas_sexos = ['Homens', 'Mulheres', 'Total']
sexos[colunas_sexos] = sexos[colunas_sexos].apply(pd.to_numeric)

total_homens = sexos.iloc[2,1]
total_mulheres = sexos.iloc[2,2]
total = sexos.iloc[2,3]

soma_homens = sexos['Homens'].sum() - total_homens
soma_mulheres = sexos['Mulheres'].sum() - total_mulheres
soma_total = sexos['Total'].sum() - total

homens_livres = sexos.iloc[0,1]
homens_escravos = sexos.iloc[1,1]

mulheres_livres = sexos.iloc[0,2]
mulheres_escravas = sexos.iloc[1,2]

total_livres = sexos.iloc[0,3]
total_escravos = sexos.iloc[1,3]


if homens_livres + mulheres_livres == total_livres:
    print("OK1")

if homens_escravos + mulheres_escravas == total_escravos:
    print("OK2")

if total_homens + total_mulheres == total:
    print("OK3")

if total_livres + total_escravos == total:
    print("OK4")


if soma_homens == total_homens:
    soma_homens
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores")
    print("Digitado na tabela: " + str(total_homens))
    print("Valor da soma: " + str(soma_homens))
    print("Diferença: " + str(soma_homens - total_homens))

if soma_mulheres == total_mulheres:
    total_mulheres
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores")
    print("Digitado na tabela: " + str(total_mulheres))
    print("Valor da soma: " + str(soma_mulheres))
    print("Diferença: " + str(soma_mulheres - total_mulheres))

#valores digitados na coluna de mulheres contém vários erros de digitação. a maior parte dos valores estão faltando o último dígito (a casa de unidade)

if soma_total == total:
    total
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores")
    print("Digitado na tabela: " + str(total))
    print("Valor da soma: " + str(soma_total))
    print("Diferença: " + str(soma_total - total))

OK1
OK2
OK3
OK4

# Estados civis

In [48]:
estados_civis = df[['Recapitulação','Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9']]
estados_civis = estados_civis.rename(columns={'Unnamed: 4': 'Solteiros', 'Unnamed: 5': 'Casados', 'Unnamed: 6': 'Viúvos', 'Unnamed: 7': 'Solteiras', 'Unnamed: 8': 'Casadas', 'Unnamed: 9': 'Viúvas'})
estados_civis.head()

       Recapitulação  Solteiros  Casados  Viúvos  Solteiras  Casadas  Viúvas
0    População livre    2975446  1165866  177387    2752582  1121000  227391
1  População escrava     711869    73079   20222     622804    63016   19816
2              Total    3687315  1238945  197609    3375386  1184016  247207

In [49]:
colunas_estados_civis = ['Solteiros', 'Casados', 'Viúvos', 'Solteiras', 'Casadas', 'Viúvas']
estados_civis[colunas_estados_civis] = estados_civis[colunas_estados_civis].apply(pd.to_numeric)


total_solteiros = estados_civis.iloc[2,1]
total_casados = estados_civis.iloc[2,2]
total_viuvos = estados_civis.iloc[2,3]

total_homens = total_solteiros + total_casados + total_viuvos

total_solteiras = estados_civis.iloc[2,4]
total_casadas = estados_civis.iloc[2,5]
total_viuvas = estados_civis.iloc[2,6]

total_mulheres = total_solteiras + total_casadas + total_viuvas

soma_solteiros = estados_civis['Solteiros'].sum() - total_solteiros
soma_casados = estados_civis['Casados'].sum() - total_casados
soma_viuvos = estados_civis['Viúvos'].sum() - total_viuvos

soma_homens = soma_solteiros + soma_casados + soma_viuvos


soma_solteiras = estados_civis['Solteiras'].sum() - total_solteiras
soma_casadas = estados_civis['Casadas'].sum() - total_casadas
soma_viuvas = estados_civis['Viúvas'].sum() - total_viuvas

soma_mulheres = soma_solteiras + soma_casadas + soma_viuvas

solteiros_livres = estados_civis.iloc[0,1]
solteiros_escravos = estados_civis.iloc[1,1]
casados_livres = estados_civis.iloc[0,2]
casados_escravos = estados_civis.iloc[1,2]
viuvos_livres = estados_civis.iloc[0,3]
viuvos_escravos = estados_civis.iloc[1,3]
solteiras_livres = estados_civis.iloc[0,4]
solteiras_escravas = estados_civis.iloc[1,4]
casadas_livres = estados_civis.iloc[0,5]
casadas_escravas = estados_civis.iloc[1,5]
viuvas_livres = estados_civis.iloc[0,6]
viuvas_escravas = estados_civis.iloc[1,6]

if solteiros_livres + solteiros_escravos == total_solteiros:
    print("OK1")

if solteiras_livres + solteiras_escravas == total_solteiras:
    print("OK2")

if casados_livres + casados_escravos == total_casados:
    print("OK3")

if casadas_livres + casadas_escravas == total_casadas:
    print("OK4")

if viuvos_livres + viuvos_escravos == total_viuvos:
    print("OK5")

if viuvas_livres + viuvas_escravas == total_viuvas:
    print("OK6")

total_livres = solteiros_livres + casados_livres + viuvos_livres + solteiras_livres + casadas_livres + viuvas_livres
print(total_livres)

total_escravos = solteiros_escravos + casados_escravos + viuvos_escravos + solteiras_escravas + casadas_escravas + viuvas_escravas
print(total_escravos)

if total_livres + total_escravos == total_solteiros + total_casados + total_viuvos + total_solteiras + total_casadas + total_viuvas:
    print("OK7")

if soma_homens == total_homens:
    soma_homens
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores")
    print("Digitado na tabela: " + str(total_homens))
    print("Valor da soma: " + str(soma_homens))
    print("Diferença: " + str(soma_homens - total_homens))

if soma_mulheres == total_mulheres:
    total_mulheres
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores")
    print("Digitado na tabela: " + str(total_mulheres))
    print("Valor da soma: " + str(soma_mulheres))
    print("Diferença: " + str(soma_mulheres - total_mulheres))


if soma_total == total:
    total
else:
    print("Discrepância entre valor digitado na tabela e soma dos valores")
    print("Digitado na tabela: " + str(total))
    print("Valor da soma: " + str(soma_total))
    print("Diferença: " + str(soma_total - total))

OK1
OK2
OK3
OK4
OK5
OK6
8419672
1510806
OK7

# Raças

In [50]:
racas = df[['Recapitulação','Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13', 'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17']]
racas = racas.rename(columns={'Unnamed: 10': 'Brancos', 'Unnamed: 11': 'Pardos', 'Unnamed: 12': 'Pretos', 'Unnamed: 13': 'Caboclos', 'Unnamed: 14': 'Brancas', 'Unnamed: 15': 'Pardas', 'Unnamed: 16': 'Pretas', 'Unnamed: 17': 'Caboclas'})
racas.head()

,Recapitulação,Brancos,Pardos,Pretos,Caboclos,Brancas,Pardas,Pretas,Caboclas
0,População livre,1971772,1673971,472008,200948,1815517,1650307,449142,186007
1,População escrava,0,252824,552346,0,0,224680,480956,0
2,Total,1971772,1926795,1024354,200948,1815517,1874987,930098,186007

# Religião

In [51]:
religiao = df[['Recapitulação','Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21']]
religiao = religiao.rename(columns={'Unnamed: 18': 'Católicos', 'Unnamed: 19': 'Acatólicos', 'Unnamed: 20': 'Católicas', 'Unnamed: 21': 'Acatólicas'})
religiao.head()

       Recapitulação  Católicos  Acatólicos  Católicas  Acatólicas
0    População livre    4302386       16313    4089520       11453
1  População escrava     895170           0     705636           0
2              Total    5107556       16313    4795156       11453

# Nacionalidades

In [52]:
nacionalidade = df[['Recapitulação','Unnamed: 22', 'Unnamed: 23', 'Unnamed: 24', 'Unnamed: 25']]
nacionalidade = nacionalidade.rename(columns={'Unnamed: 22': 'Brasileiros', 'Unnamed: 23': 'Estrangeiros', 'Unnamed: 24': 'Brasileiras', 'Unnamed: 25': 'Estrangeiras'})
nacionalidade.head()

       Recapitulação  Brasileiros  Estrangeiros  Brasileiras  Estrangeiras
0    População livre      4139362        179337      4036829         64144
1  População escrava       719630         35540       352616         53020
2              Total      4853992        264877      4689945        117164

# Grau de instrução

In [53]:
instrucao = df[['Recapitulação','Unnamed: 26', 'Unnamed: 27', 'Unnamed: 28', 'Unnamed: 29', 'Unnamed: 30', 'Unnamed: 31', 'Unnamed: 32', 'Unnamed: 33', 'Unnamed: 34', 'Unnamed: 35']]
instrucao = instrucao.rename(columns={'Unnamed: 26': 'Sabem ler e escrever', 'Unnamed: 27': 'Analfabetos', 'Unnamed: 28': 'Sabem ler e escrever', 'Unnamed: 29': 'Analfabetas', 'Unnamed: 30': 'Frequentam escolas', 'Unnamed: 31': 'Não frequentam', 'Unnamed: 32': 'Total', 'Unnamed: 33': 'Frequentam escolas', 'Unnamed: 34': 'Não frequentam', 'Unnamed: 35': 'Total'})
instrucao.head()

,Recapitulação,Sabem ler e escrever,Analfabetos,Sabem ler e escrever,Analfabetas,Frequentam escolas,Não frequentam,Total,Frequentam escolas,Não frequentam,Total
0,População livre,1012097,3306602,550981,3549992,155651,786131,941782,165098,795574,960672
1,População escrava,958,804212,445,705191,155651,786131,941782,165098,795574,960672
2,Total,1013055,4110814,551426,4255183,155651,786131,941782,165098,1332274,960672

# Grau de instrução (adultos)

In [54]:
instrucao_adultos = df[['Recapitulação','Unnamed: 26', 'Unnamed: 27', 'Unnamed: 28', 'Unnamed: 29']]
instrucao_adultos = instrucao_adultos.rename(columns={'Unnamed: 26': 'Sabem ler e escrever', 'Unnamed: 27': 'Analfabetos', 'Unnamed: 28': 'Sabem ler e escrever ', 'Unnamed: 29': 'Analfabetas'})
instrucao_adultos.head()

,Recapitulação,Sabem ler e escrever,Analfabetos,Sabem ler e escrever,Analfabetas
0,População livre,1012097,3306602,550981,3549992
1,População escrava,958,804212,445,705191
2,Total,1013055,4110814,551426,4255183

In [55]:
colunas_instrucao_adultos = ['Sabem ler e escrever', 'Analfabetos', 'Sabem ler e escrever ', 'Analfabetas']
instrucao_adultos[colunas_instrucao_adultos] = instrucao_adultos[colunas_instrucao_adultos].apply(pd.to_numeric)
#colocando espaço no final da terceira string pois não permite duas idênticas


alfabetizados_livres = instrucao_adultos.iloc[0,1]
alfabetizados_escravos = instrucao_adultos.iloc[1,1]
alfabetizadas_livres = instrucao_adultos.iloc[0,3]
alfabetizadas_escravas = instrucao_adultos.iloc[1,3]

analfabetos_livres = instrucao_adultos.iloc[0,2]
analfabetos_escravos = instrucao_adultos.iloc[1,2]
analfabetas_livres = instrucao_adultos.iloc[0,4]
analfabetas_escravas = instrucao_adultos.iloc[1,4]


total_alfabetizados = instrucao_adultos.iloc[2,1]
total_alfabetizadas = instrucao_adultos.iloc[2,3]
total_analfabetos = instrucao_adultos.iloc[2,2]
total_analfabetas = instrucao_adultos.iloc[2,4]

soma_alfabetizados = alfabetizados_livres + alfabetizados_escravos
soma_alfabetizadas = alfabetizadas_livres + alfabetizadas_escravas

soma_analfabetos = analfabetos_livres + analfabetos_escravos
soma_analfabetas = analfabetas_livres + analfabetas_escravas

total_livres = alfabetizados_livres + analfabetos_livres + alfabetizadas_livres + analfabetas_livres
total_escravos = alfabetizados_escravos + analfabetos_escravos + alfabetizadas_escravas + analfabetas_escravas

if total_alfabetizados + total_alfabetizadas == soma_alfabetizados + soma_alfabetizadas:
    print("OK1")

if total_analfabetos + total_analfabetas == soma_analfabetos + soma_analfabetas:
    print("OK2")

if soma_alfabetizados == total_alfabetizados:
    print("OK3")

if soma_alfabetizadas == total_alfabetizadas:
    print("OK4")

OK1
OK2
OK3
OK4

# Grau de instrução (jovens)

In [56]:
instrucao_jovens = df[['Recapitulação', 'Unnamed: 30', 'Unnamed: 31', 'Unnamed: 32', 'Unnamed: 33', 'Unnamed: 34', 'Unnamed: 35']]
instrucao_jovens = instrucao_jovens.rename(columns={'Unnamed: 30': 'Frequentam escolas', 'Unnamed: 31': 'Não frequentam', 'Unnamed: 32': 'Total', 'Unnamed: 33': 'Frequentam escolas ', 'Unnamed: 34': 'Não frequentam ', 'Unnamed: 35': 'Total '})
instrucao_jovens.head()

,Recapitulação,Frequentam escolas,Não frequentam,Total,Frequentam escolas,Não frequentam,Total
0,População livre,155651,786131,941782,165098,795574,960672
1,População escrava,155651,786131,941782,165098,795574,960672
2,Total,155651,786131,941782,165098,1332274,960672

In [57]:
colunas_instrucao_jovens = ['Frequentam escolas', 'Não frequentam', 'Total', 'Frequentam escolas ', 'Não frequentam ', 'Total ']
instrucao_jovens[colunas_instrucao_jovens] = instrucao_jovens[colunas_instrucao_jovens].apply(pd.to_numeric)
#colocando espaço no final a partir da terceira string pois não permite duas idênticas


meninos_escola = instrucao_jovens.iloc[0,1]
meninas_escola = instrucao_jovens.iloc[0,4]

meninos_sem_escola = instrucao_jovens.iloc[0,2]
meninas_sem_escola = instrucao_jovens.iloc[0,5]

total_meninos_escola = instrucao_jovens.iloc[2,1]
total_meninas_escola = instrucao_jovens.iloc[2,4]

total_meninos_sem_escola = instrucao_jovens.iloc[2,2]
total_meninas_sem_escola = instrucao_jovens.iloc[2,5]

total_meninos = instrucao_jovens.iloc[0,3]
total_meninas = instrucao_jovens.iloc[0,6]


soma_meninos = total_meninos_escola + total_meninos_sem_escola 
soma_meninas = total_meninas_escola + total_meninas_sem_escola

soma_total = total_meninos + total_meninas


if meninos_escola + meninos_sem_escola == total_meninos:
    print("OK1")

if meninas_escola + meninas_sem_escola == total_meninas:
    print("OK2")

OK1
OK2

# Casas

In [58]:
casas = df[['Recapitulação', 'Unnamed: 36', 'Unnamed: 37', 'Unnamed: 38']]
casas = casas.rename(columns={'Unnamed: 36': 'Habitadas', 'Unnamed: 37': 'Desabitadas', 'Unnamed: 38': 'Total'})
casas.head()

       Recapitulação  Habitadas  Desabitadas    Total
0    População livre    1296060        34150  1330210
1  População escrava    1296060        34150  1330210
2              Total    1296060        34150  1330210

In [59]:
colunas_casas = ['Habitadas', 'Desabitadas', 'Total']
casas[colunas_casas] = casas[colunas_casas].apply(pd.to_numeric)

total_habitadas = casas.iloc[0,1]
total_desabitadas = casas.iloc[0,2]
total_casas = casas.iloc[0,3]

if total_casas == total_habitadas + total_desabitadas:
    print("OK")

OK

# Fogos

In [60]:
fogos = df[['Recapitulação', 'Unnamed: 39']]
fogos = fogos.rename(columns={'Unnamed: 39': 'Fogos'})
fogos.head()

       Recapitulação    Fogos
0    População livre  1332274
1  População escrava  1332274
2              Total  1332274

In [61]:
colunas_fogos = ['Fogos']
fogos[colunas_fogos] = fogos[colunas_fogos].apply(pd.to_numeric)

total_fogos = fogos.iloc[2,1]

total_fogos

1332274

In [62]:
'''
data = {
    ('A', 'X'): [1, 2, 3],
    ('A', 'Y'): [4, 5, 6],
    ('B', 'X'): [7, 8, 9],
    ('B', 'Y'): [10, 11, 12]
}

# Create a DataFrame with multi-index columns
df = pd.DataFrame(data)

# Create multi-index header
header = pd.MultiIndex.from_tuples([('A', 'Group1'), ('A', 'Group2'), ('B', 'Group1'), ('B', 'Group2')])

# Assign the multi-index header to the DataFrame columns
df.columns = header

print(df)
'''

"\ndata = {\n    ('A', 'X'): [1, 2, 3],\n    ('A', 'Y'): [4, 5, 6],\n    ('B', 'X'): [7, 8, 9],\n    ('B', 'Y'): [10, 11, 12]\n}\n\n# Create a DataFrame with multi-index columns\ndf = pd.DataFrame(data)\n\n# Create multi-index header\nheader = pd.MultiIndex.from_tuples([('A', 'Group1'), ('A', 'Group2'), ('B', 'Group1'), ('B', 'Group2')])\n\n# Assign the multi-index header to the DataFrame columns\ndf.columns = header\n\nprint(df)\n"